app/controllers/rooms_controller.rb

INSERT INTO "rooms" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "room1"], ["created_at", "2020-07-09 13:30:10.888535"], ["updated_at", "2020-07-09 13:30:10.888535"]]
---
  def create
    @room = Room.new permitted_parameters

    if @room.save

SELECT "room_messages".* FROM "room_messages" WHERE "room_messages"."room_id" = ?  [["room_id", 1]]
SELECT "rooms".* FROM "rooms"
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 1], ["id", 2]]
---
  def show
    @room_message = RoomMessage.new room: @room
    @room_messages = @room.room_messages.includes(:user)

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def load_entities
    @rooms = Room.all
    @room = Room.find(params[:id]) if params[:id]